---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.ZoneEquipment
source: html/62330781-b72c-02ae-0c30-c557decfc38a.htm
---
# Autodesk.Revit.DB.Mechanical.ZoneEquipment

Represents an early-stage equipment placeholder that provides heating or cooling to part of air system or water loop.

## Syntax (C#)
```csharp
public class ZoneEquipment : Element
```

## Remarks
A zone equipment is different from physical equipment.
 Depending on its behavior type, it may be mapped to multiple physical equipment later.